markogalevski/i2c_driver/i2c_stm32f411.c
/*******************************************************************************
* Title                 :   I2C Implementation for STM32F411
* Filename              :   i2c_stm32f411.c
* Author                :   Marko Galevski
* Origin Date           :   20/01/2020
* Version               :   1.0.0
* Compiler              :   GCC
* Target                :   STM32F411 (Arm Cortex M4)
* Notes                 :   None
*
*
*******************************************************************************/
/****************************************************************************
* Doxygen C Template
* Copyright (c) 2013 - Jacob Beningo - All Rights Reserved
*
* Feel free to use this Doxygen Code Template at your own risk for your own
* purposes.  The latest license and updates for this Doxygen C template can be
* found at www.beningo.com or by contacting Jacob at jacob@beningo.com.
*
* For updates, free software, training and to stay up to date on the latest
* embedded software techniques sign-up for Jacobs newsletter at
* http://www.beningo.com/814-2/
*
* The above copyright notice and this permission notice shall be included in
* all copies or substantial portions of the Template.
*
*****************************************************************************/

/** @file i2c_stm32f411.c
 *  @brief Chip specific implementation for i2c communication.
 */
#include "i2c_interface.h"
#include "stm32f411xe.h"
#include <assert.h>

/**
 * Rise times obtained from the phillips i2c spec sheet
 */
#define SM_RISE_TIME_MAX 1000 /**<Maximum rise time for a stanard mode pulse in ns.*/
#define FM_RISE_TIME_MAX 300 /**<Maximum rise time for a fast mode pulse in ns.  */

/**
 * Array of pointers to the Control Register 1 registers
 */
static volatile uint16_t *const I2C_CR1[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE, (uint16_t *)I2C2_BASE, (uint16_t *)I2C3_BASE
};

/**
 * Array of pointers to the Control Register 2 registers
 */
static volatile uint16_t *const I2C_CR2[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x04UL, (uint16_t *)I2C2_BASE + 0x04UL,
	(uint16_t *)I2C3_BASE + 0x04UL

};

/**
 * Array of pointers to the Own Address 1 registers
 */
static volatile uint16_t *const I2C_OAR1[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x08UL, (uint16_t *)I2C2_BASE + 0x08UL,
	(uint16_t *)I2C3_BASE + 0x08UL
};

/**
 * Array of pointers to the Own Address 2 registers
 */
static volatile uint16_t *const I2C_OAR2[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x0CUL, (uint16_t *)I2C2_BASE + 0x0CUL,
	(uint16_t *)I2C3_BASE + 0x0CUL
};

/**
 * Array of pointers to the Data registers
 */
static volatile uint16_t *const I2C_DR[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x10UL, (uint16_t *)I2C2_BASE + 0x10UL,
	(uint16_t *)I2C3_BASE + 0x10UL
};

/**
 * Array of pointers to the Status Register 1 registers
 */
static volatile uint16_t *const I2C_SR1[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x14UL, (uint16_t *)I2C2_BASE + 0x14UL,
	(uint16_t *)I2C3_BASE + 0x14UL
};

/**
 * Array of pointers to the Status Register 2 registers
 */
static volatile uint16_t *const I2C_SR2[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x18UL, (uint16_t *)I2C2_BASE + 0x18UL,
	(uint16_t *)I2C3_BASE + 0x18UL
};

/**
 * Array of pointers to the clock control registers
 */
static volatile uint16_t *const I2C_CCR[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x1CUL, (uint16_t *)I2C2_BASE + 0x1CUL,
	(uint16_t *)I2C3_BASE + 0x1CUL
};

/**
 * Array of pointers to the rise time registers
 */
static volatile uint16_t *const I2C_TRISE[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x20UL, (uint16_t *)I2C2_BASE + 0x20UL,
	(uint16_t *)I2C3_BASE + 0x20UL
};

/**
 * Array of pointers to the filter registers
 */
static volatile uint16_t *const I2C_FLTR[NUM_I2C] =
{
	(uint16_t *)I2C1_BASE + 0x24UL, (uint16_t *)I2C2_BASE + 0x24UL,
	(uint16_t *)I2C3_BASE + 0x24UL
};

/**
 * Static array which holds copies of requested interrupt based transfers
 */
static i2c_transfer_t i2c_interrupt_transfers[NUM_I2C];

/**
 * Callback typedef for interrupt callbacks
 */
typedef void (*i2c_interrupt_callback_t)(i2c_transfer_t *);
/**
 * Static array containing interrupt callbacks currently mapped to
 * each i2c channel
 */
static i2c_interrupt_callback_t i2c_interrupt_callbacks[NUM_I2C];

static uint32_t i2c_calculate_ccr(i2c_config_t *config_entry);
static uint32_t i2c_calculate_trise(i2c_config_t *config_entry);
static void i2c_clear_addr_bit(i2c_channel_t channel);
static void i2c_clear_stopf_bit(i2c_channel_t channel);
static void i2c_one_byte_reception(i2c_transfer_t *i2c_transfer);
static void i2c_two_byte_reception(i2c_transfer_t *i2c_transfer);
static void i2c_n_byte_reception(i2c_transfer_t *i2c_transfer);

/******************************************************************************
* Function: i2c_init()
*//**
* \b Description:
*
* 	Carries out the initialisation of the I2C channels as per the information
* 	in the config table
*
*
* PRE-CONDITION: The config table has been obtained and is non-null
* PRE-CONDITION: The required GPIO pins for i2c combination have been configured
* 					correctly with gpio_init
* PRE-CONDITION: The appropriate peripheral clocks have been activated
*
* POST-CONDITION: The selected i2c channels have been activated anda ready to be used
*
*
* @return 		void
*
* \b Example:
* @code
*	const i2c_config_t *config_table = i2c_config_get();
*	i2c_init(config_table);
* @endcode
** POST-CONDITION: The appropraite trise value has been calculated and placed in the register
*
* @see i2c_config_get
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
void i2c_init(const i2c_config_t *config_table)
{
	for (int i2c_channel = 0; i2c_channel < NUM_I2C; i2c_channel++)
	{
		if (config_table[i2c_channel].en == ENABLED)
		{
			*I2C_CR1[i2c_channel] &= ~(I2C_CR1_PE_Msk);

			*I2C_CR1[i2c_channel] = config_table[i2c_channel].ack_en << I2C_CR1_ACK_Pos;

