markogalevski/i2c_driver/i2c_stm32f411.c
			assert(config_table[i2c_channel].periph_clk_freq_MHz <= 50
					&& config_table[i2c_channel].periph_clk_freq_MHz > 1);

			*I2C_CR2[i2c_channel] |= config_table[i2c_channel].periph_clk_freq_MHz << I2C_CR2_FREQ_Pos;
			*I2C_CCR[i2c_channel] |= config_table[i2c_channel].fast_or_std << I2C_CCR_FS_Pos
									| config_table[i2c_channel].duty_cycle << I2C_CCR_DUTY_Pos;

			*I2C_CCR[i2c_channel] = i2c_calculate_ccr((i2c_config_t *) &config_table[i2c_channel]);
			*I2C_TRISE[i2c_channel] = i2c_calculate_trise((i2c_config_t *) &config_table[i2c_channel]);

			*I2C_CR1[i2c_channel] |= I2C_CR1_PE_Msk;
		}
	}
}


/******************************************************************************
* Function: i2c_calculate_ccr()
*//**
* \b Description:
*
* 	Static inline function called from within the driver to carry out the calculation of
* 	the required pulse length for a given frequency.
*
*
* PRE-CONDITION: The config table has been obtained and is non-null
*
* POST-CONDITION: The appropriate cc value has been calculated and placed in the register
*
* @return 		uint32_t
*
* \b Example:
* 	Automatically called within i2c_init
*
* @see i2c_init
* @see i2c_calculate_trise
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
static inline uint32_t i2c_calculate_ccr(i2c_config_t *config_entry)
{
	uint32_t calculated_ccr = 0;
	if (config_entry->fast_or_std == I2C_SM)
	{
		assert(config_entry->i2c_op_freq_kHz <= 100);
		/**
		 * Equation obtained from RM0383 18.6.8:
		 * \f$ CCR = \frac{T_{high}}{T_{pclk}}\f$,
		 * where
		 * \f$ T_{high} = \frac{1}{2 \times T_{opfreq}} \f$ (kHz)
		 * and
		 * \f$ T_{opfreq} = \frac{1}{f_{opfreq}} \f$
		 * and \f$ T_{pclk} = \frac{1}{f_{pclk}} \f$
		 * leading to
		 * \f$ CCR = \frac{f_{pclk} (MHz) }{2 \times f_{opfreq} (khZ)}
		 * 			= \frac{f_{pclk}}{2000 \times f_{opfreq}} \f$
		 */
		calculated_ccr = (config_entry->periph_clk_freq_MHz)/(2000UL*config_entry->i2c_op_freq_kHz);
	}
	else if (config_entry->fast_or_std == I2C_FM)
	{
		assert(config_entry->i2c_op_freq_kHz <= 400);
		assert(config_entry->periph_clk_freq_MHz > 0x03);
		if (config_entry->duty_cycle == FM_MODE_2)
		{
			/**
			 * Equation obtained from RM0383 18.6.8:
			 * \f$ CCR = \frac{T_{high}}{T_{pclk}}\f$,
			 * where
			 * \f$ T_{high} = \frac{1}{3 \times T_{opfreq}} \f$ (kHz)
			 * and
			 * \f$ T_{opfreq} = \frac{1}{f_{opfreq}} \f$
			 * and \f$ T_{pclk} = \frac{1}{f_{pclk}} \f$
			 * leading to
			 * \f$ CCR = \frac{f_{pclk} (MHz) }{3 \times f_{opfreq} (khZ)}
			 * 			= \frac{f_{pclk}}{3000 \times f_{opfreq}} \f$
			 */
		calculated_ccr = (config_entry->periph_clk_freq_MHz)/(3000UL*config_entry->i2c_op_freq_kHz);
		}
		else if (config_entry->duty_cycle == FM_MODE_16_9)
		{
			/**
			 * Equation obtained from RM0383 18.6.8:
			 * \f$ CCR = \frac{T_{high}}{T_{pclk}}\f$,
			 * where
			 * \f$ T_{high} = \frac{25}{9 \times T_{opfreq}} \f$ (kHz)
			 * and
			 * \f$ T_{opfreq} = \frac{1}{f_{opfreq}} \f$
			 * and \f$ T_{pclk} = \frac{1}{f_{pclk}} \f$
			 * leading to
			 * \f$ CCR = \frac{9 \times f_{pclk} (MHz) }{25 \times f_{opfreq} (khZ)}
			 * 			= \frac{9 \times f_{pclk}}{25000 \times f_{opfreq}} \f$
			 */
		calculated_ccr = (9UL*config_entry->periph_clk_freq_MHz)/(25000UL*config_entry->i2c_op_freq_kHz);
		}
	}
	assert(calculated_ccr < (0x02 << 12)); //Check for proper CCR size.
	return (calculated_ccr);
}

/******************************************************************************
* Function: i2c_calculate_trise()
*//**
* \b Description:
*
* 	Static inline function called from within the driver to carry out the calculation of
* 	the required rise time
*
*
* PRE-CONDITION: The config table has been obtained and is non-null
*
* POST-CONDITION: The appropriate trise value has been calculated and placed in the register
*
* @return 		uint32_t
*
* \b Example:
* 	Automatically called within i2c_init
*
* @see i2c_init
* @see i2c_calculate_ccr
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
static inline uint32_t i2c_calculate_trise(i2c_config_t *config_entry)
{
	uint32_t calculated_trise = 0;
	if (config_entry->fast_or_std == I2C_SM)
		{
		//for standard mode, max rise time is 1000 nano seconds. Or a single 1MHz pulse.
		calculated_trise = config_entry->periph_clk_freq_MHz + 1;
		}
	else if (config_entry->fast_or_std == I2C_FM)
	{
		//for fast mode, max rise time is 300 nanoseconds, or 3.33MHz
		calculated_trise = (uint32_t) (config_entry->periph_clk_freq_MHz * 3.33F) + 1;
	}
	assert(calculated_trise < (0x02 << 6));

	return (calculated_trise);
}

/******************************************************************************
* Function: i2c_interrupt_control()
*//**
* \b Description:
*
* 	Enabled or disables the selected interrupt on the selected channel. Caled both by users
* 	and within the driver itself
*
*
* PRE-CONDITION: The i2c_init function has been carried out successfully
*
* POST-CONDITION: The desired interrupt on the selected device has been activated/disabled
*
* @return 		void
*
* \b Example:
* @code
*	i2c_interrupt_control(I2C_2, IT_BUF, INTERRUPT_ENABLED);
* @endcode
*
* @see i2c_init
* @see i2c_master_transmit_it
* @see i2c_master_receive_it
* @see i2c_slave_transmit_it
* @see i2c_slave_receive_it
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
void i2c_interrupt_control(i2c_channel_t channel, i2c_interrupt_dma_t interrupt, i2c_interrupt_control_t signal)
{
	if (signal == INTERRUPT_ENABLED)
	{
		*I2C_CR2[channel] |= (0x01UL) << (8 + interrupt);
	}
	else
	{
		*I2C_CR2[channel] &= ~(0x01UL) << (8 + interrupt);
	}
}

