markogalevski/i2c_driver/i2c_stm32f411.c
/******************************************************************************
* Function: i2c_master_transmit()
*//**
* \b Description:
*
* 	Initiates a blocking transmission in master mode using the parameters specified in transfer
*
*
* PRE-CONDITION: i2c_init has been carried out properly
* PRE-CONDITION: The data buffer points to non-null location and the
* 					transfer length is non-zero.
*
* POST-CONDITION: The data has been sent to the slave
*
* @param		i2c_transfer is a pointer to a struct which contains all the information
* 					required to carry out a transfer.
* @return 		void
*
* \b Example:
* @code
* 	i2c_init(config_table);
* 	i2c_transfer_t motor_controller_comm;
* 	motor_controller_comm.channel = I2C_2;
* 	motor_controller_comm.buffer = &data_to_motor;
* 	motor_controller_comm.length = 4;
* 	motor_controller_comm.address = MOTOR_CONTROLLER_ADDRESS;
* 	i2c_master_transmit(&motor_controller_comm);
* @endcode
*
* @see i2c_init
* @see i2c_master_receive
* @see i2c_slave_transmit
* @see i2c_slave_receive
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
void i2c_master_transmit(i2c_transfer_t *i2c_transfer)
{
	uint16_t status_reg = 0;
	//1. Generate START condition
	*I2C_CR1[i2c_transfer->channel] |= (I2C_CR1_START_Msk);
	//2. Read SR1
	status_reg = *I2C_SR1[i2c_transfer->channel];
	//disable POS
	*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_POS_Msk;
	//3. Write Slave Address into DR
	*I2C_DR[i2c_transfer->channel] = i2c_transfer->slave_address;
	i2c_clear_addr_bit(i2c_transfer->channel);

	//loop
	while(i2c_transfer->data_length > 0)
	{
		//6. Wait for TxE
	    do
		{
		  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_TXE_Msk;
		}while (status_reg == 0);
	    //6. Write data byte into DR
		*I2C_DR[i2c_transfer->channel] = *(i2c_transfer->buffer);
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
		status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
		if (status_reg != 0 && i2c_transfer->data_length != 0)
		{
			*I2C_DR[i2c_transfer->channel] = *(i2c_transfer->buffer);
			i2c_transfer->buffer++;
			i2c_transfer->data_length--;
		}

	}
	//8. Send STOP condition
	*I2C_CR1[i2c_transfer->channel] |= (I2C_CR1_STOP_Msk);

}

/******************************************************************************
* Function: i2c_master_receive()
*//**
* \b Description:
*
* 	Initiates a blocking reception in master mode using the parameters specified in transfer
*
*
* PRE-CONDITION: i2c_init has been carried out properly
* PRE-CONDITION: The data buffer points to non-null location and the
* 					transfer length is non-zero.
*
* POST-CONDITION: The data has been received from the slave
*
* @param		i2c_transfer is a pointer to a struct which contains all the information
* 					required to carry out a transfer.
* @return 		void
*
* \b Example:
* @code
* 	i2c_init(config_table);
* 	i2c_transfer_t accelerometer_comm;
* 	accelerometer_comm.channel = I2C_2;
* 	accelerometer_comm.buffer = &data_from_accel;
* 	accelerometer_comm.length = 2;
* 	accelerometer_comm.address = ACCELEROMETER_ADDRESS;
* 	i2c_master_transmit(&accelerometer_comm);
* @endcode
*
* @see i2c_init
* @see i2c_master_transmit
* @see i2c_slave_transmit
* @see i2c_slave_receive
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
void i2c_master_receive(i2c_transfer_t *i2c_transfer)
{
	/*
	 * NOTE: Only using 7 bit addressing. Will extend for 10 if necessary
	 * Master reception for i2c has 3 major potential states depending on transfer length (N) bytes:
	 * 1. N = 1; instant ACK disable
	 * 2. N = 2; instant ACK disable followed by a double read
	 * 3. N > 2; disables ACK upon the last 3 bytes.
	 */
	uint16_t status_reg = 0;
	assert(i2c_transfer->data_length != 0 && i2c_transfer->buffer != 0UL);

	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_ACK_Msk; //assume ack will be used
	//1. Generate START condition
	*I2C_CR1[i2c_transfer->channel] |= (I2C_CR1_START_Msk);
	//2. Read SR1
	status_reg = *I2C_SR1[i2c_transfer->channel];
	//3. Write Slave Address +1 into DR
	*I2C_DR[i2c_transfer->channel] = i2c_transfer->slave_address | (0x01);
	//SB bit is now clear.
	/*
	 * this is where the transfer methods branch.
	 */
	do
	{
		status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_ADDR_Msk;
	} while (status_reg == 0);

	if (i2c_transfer->data_length == 0UL)
	{
		i2c_clear_addr_bit(i2c_transfer->channel);
		*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_STOP_Msk;
	}
	else if (i2c_transfer->data_length == 1UL)
	{
		i2c_one_byte_reception(i2c_transfer);
	}
	else if (i2c_transfer->data_length == 2UL)
	{
		i2c_two_byte_reception(i2c_transfer);
	}
	else
	{
		i2c_n_byte_reception(i2c_transfer);
	}
}

/******************************************************************************
* Function: i2c_slave_transmit()
*//**
* \b Description:
*
* 	Initiates a blocking transmission in slave mode using the parameters specified in transfer
*
*
* PRE-CONDITION: i2c_init has been carried out properly
* PRE-CONDITION: The data buffer points to non-null location and the
* 					transfer length is non-zero.
*
* POST-CONDITION: The data has been sent to the master
*
* @param		i2c_transfer is a pointer to a struct which contains all the information
* 					required to carry out a transfer.
* @return 		void
*
* \b Example:
* @code
* 	i2c_init(config_table);
* 	i2c_transfer_t motor_controller_comm;
* 	motor_controller_comm.channel = I2C_2;
* 	motor_controller_comm.buffer = &data_to_motor;
* 	motor_controller_comm.length = 4;
* 	motor_controller_comm.address = MOTOR_CONTROLLER_ADDRESS;
* 	i2c_master_transmit(&motor_controller_comm);
* @endcode
*
* @see i2c_init
* @see i2c_master_transmit
* @see i2c_slave_transmit
* @see i2c_slave_receive
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
void i2c_slave_transmit(i2c_transfer_t *i2c_transfer)
{
  uint32_t status_reg;
  assert(i2c_transfer->buffer != 0);
  *I2C_CR1[i2c_transfer->channel] |= I2C_CR1_ACK_Msk;
  do
  {
	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_ADDR_Msk;
  } while(status_reg == 0);
  i2c_clear_addr_bit(i2c_transfer->channel);
  while (i2c_transfer->data_length > 0UL)
  {
	  do
	  {
	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_TXE_Msk;
	  }while (status_reg ==  0);

	  *I2C_DR[i2c_transfer->channel] = *i2c_transfer->buffer;
	  i2c_transfer->buffer++;
	  i2c_transfer->data_length--;

