markogalevski/i2c_driver/i2c_stm32f411.c
	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
	  if (status_reg && i2c_transfer->data_length != 0)
	  {
		  *I2C_DR[i2c_transfer->channel] = *i2c_transfer->buffer;
		  i2c_transfer->buffer++;
		  i2c_transfer->data_length--;
	  }
  }

  	  *I2C_SR1[i2c_transfer->channel] &= ~I2C_SR1_AF_Msk;
  	  *I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;

}

/******************************************************************************
* Function: i2c_slave_receive()
*//**
* \b Description:
*
* 	Initiates a blocking reception in master mode using the parameters specified in transfer
*
*
* PRE-CONDITION: i2c_init has been carried out properly
* PRE-CONDITION: The data buffer points to non-null location and the
* 					transfer length is non-zero.
*
* POST-CONDITION: The data has been received from the slave
*
* @param		i2c_transfer is a pointer to a struct which contains all the information
* 					required to carry out a transfer.
* @return 		void
*
* \b Example:
* @code
* 	i2c_init(config_table);
* 	i2c_transfer_t accelerometer_comm;
* 	accelerometer_comm.channel = I2C_2;
* 	accelerometer_comm.buffer = &data_from_accel;
* 	accelerometer_comm.length = 2;
* 	accelerometer_comm.address = ACCELEROMETER_ADDRESS;
* 	i2c_master_transmit(&accelerometer_comm);
* @endcode
*
* @see i2c_init
* @see i2c_master_transmit
* @see i2c_slave_transmit
* @see i2c_slave_receive
* <br><b> - CHANGE HISTORY - </b>
*
* <table align="left" style="width:800px">
* <tr><td> Date       </td><td> Software Version </td><td> Initials </td><td> Description </td></tr>
* </table><br><br>
* <hr>
*******************************************************************************/
void i2c_slave_receive(i2c_transfer_t *i2c_transfer)
{
	uint32_t status_reg;
	assert(i2c_transfer->buffer != 0);
	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_ACK_Msk;
	*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_POS_Msk;
	do
	{
	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_ADDR_Msk;
	} while(status_reg == 0);
	i2c_clear_addr_bit(i2c_transfer->channel);

	while(i2c_transfer->data_length > 0)
	{
		do
		{
			status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_RXNE_Msk;
		} while(status_reg == 0);

		*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
		status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
	    if (status_reg && i2c_transfer->data_length != 0)
	    {
	    	*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
	    	i2c_transfer->buffer++;
	    	i2c_transfer->data_length--;
	    }
	}

	do
		status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_STOPF_Msk;
	while (status_reg == 0);
	i2c_clear_stopf_bit(i2c_transfer->channel);
	*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
}


static void i2c_master_transmit_it_callback(i2c_transfer_t *i2c_transfer)
{
	uint32_t status_reg = *I2C_SR1[i2c_transfer->channel];
	if (status_reg & I2C_SR1_ADDR_Msk)
		i2c_clear_addr_bit(i2c_transfer->channel);
	else if ((status_reg & I2C_SR1_TXE_Msk) && i2c_transfer->data_length > 0)
	{
		*I2C_DR[i2c_transfer->channel] = *i2c_transfer->buffer;
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
		status_reg = *I2C_SR1[i2c_transfer->channel];
	}
	if ((status_reg & I2C_SR1_BTF_Msk) && i2c_transfer->data_length > 0)
	{
		*I2C_DR[i2c_transfer->channel] = *i2c_transfer->buffer;
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
	}

	if (i2c_transfer->data_length == 0)
	{
		*I2C_CR2[i2c_transfer->channel] &= ~(I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
		*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_STOP_Msk;
	}
}

static void i2c_master_receive_it_callback(i2c_transfer_t *i2c_transfer)
{
	uint32_t status_reg = *I2C_SR1[i2c_transfer->channel];
	if (status_reg & I2C_SR1_ADDR_Msk)
	{
		i2c_clear_addr_bit(i2c_transfer->channel);
	}
	else if (status_reg && I2C_SR1_RXNE_Msk && i2c_transfer->data_length > 3)
	{
		*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
	}
	else if ((status_reg & I2C_SR1_BTF_Msk) && i2c_transfer->data_length > 3)
	{
		*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
	}
	else if (i2c_transfer->data_length == 3)
	{
		*I2C_CR2[i2c_transfer->channel] &= ~(I2C_CR2_ITBUFEN_Msk | I2C_CR2_ITEVTEN_Msk);
		do
		{
			status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
		} while(status_reg == 0);

		*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
		*i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;

		do
		{
		 status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
		} while(status_reg ==  0);
		*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_STOP_Msk;
		*i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
		*i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
		*I2C_CR2[i2c_transfer->channel] &= ~(I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
	}
}

static void i2c_slave_transmit_it_callback(i2c_transfer_t *i2c_transfer)
{
	uint32_t status_reg = *I2C_SR1[i2c_transfer->channel];
	if (status_reg & I2C_SR1_ADDR_Msk)
	{
		i2c_clear_addr_bit(i2c_transfer->channel);
	}
	else if ((status_reg & I2C_SR1_TXE_Msk) && i2c_transfer->data_length > 0)
	{
		*I2C_DR[i2c_transfer->channel] = *i2c_transfer->buffer;
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
	}
	else if ((status_reg & I2C_SR1_BTF_Msk) && i2c_transfer->data_length < 0)
	{
		*I2C_DR[i2c_transfer->channel] = *i2c_transfer->buffer;
		i2c_transfer->buffer++;
		i2c_transfer->data_length--;
	}
	if (i2c_transfer->data_length == 0)
	{
		*I2C_CR2[i2c_transfer->channel] &= ~(I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
		*I2C_SR1[i2c_transfer->channel] &= ~I2C_SR1_AF_Msk;
		*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
	}
}

static void i2c_slave_receive_it_callback(i2c_transfer_t *i2c_transfer)
{
  uint32_t status_reg = *I2C_SR1[i2c_transfer->channel];
  if (status_reg & I2C_SR1_ADDR_Msk)
  {
	  i2c_clear_addr_bit(i2c_transfer->channel);
  }
  else if ((status_reg & I2C_SR1_RXNE_Msk) && i2c_transfer->data_length > 0)
  {
	  *i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
	  i2c_transfer->buffer++;
	  i2c_transfer->data_length--;
  }
  else if ((status_reg & I2C_SR1_BTF_Msk) && i2c_transfer->data_length > 0)
  {
	  *i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
	  i2c_transfer->buffer++;
	  i2c_transfer->data_length--;
  }
  else if (status_reg & I2C_SR1_STOPF_Msk)
  {
	  *I2C_CR2[i2c_transfer->channel] &= ~(I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
	  i2c_clear_stopf_bit(i2c_transfer->channel);
	  *I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
  }
}



void i2c_master_transmit_it(i2c_transfer_t *i2c_transfer)
{
	i2c_interrupt_transfers[i2c_transfer->channel] = *i2c_transfer;
	i2c_interrupt_callbacks[i2c_transfer->channel] = i2c_master_transmit_it_callback;
	*I2C_CR2[i2c_transfer->channel] |= (I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_START_Msk;
	volatile uint32_t status_reg = *I2C_SR1[i2c_transfer->channel];
	*I2C_DR[i2c_transfer->channel] = i2c_transfer->slave_address;
}

void i2c_master_receive_it(i2c_transfer_t *i2c_transfer)
{
	i2c_interrupt_transfers[i2c_transfer->channel] = *i2c_transfer;
	i2c_interrupt_callbacks[i2c_transfer->channel] = i2c_master_receive_it_callback;
	*I2C_CR2[i2c_transfer->channel] |= (I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_START_Msk;
	volatile uint32_t status_reg = *I2C_SR1[i2c_transfer->channel];
	*I2C_DR[i2c_transfer->channel] = i2c_transfer->slave_address | 0x01;
}

