markogalevski/i2c_driver/i2c_stm32f411.c
void i2c_slave_transmit_it(i2c_transfer_t *i2c_transfer)
{
	i2c_interrupt_transfers[i2c_transfer->channel] = *i2c_transfer;
	i2c_interrupt_callbacks[i2c_transfer->channel] = i2c_slave_transmit_it_callback;
	*I2C_CR2[i2c_transfer->channel] |= (I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
}

void i2c_slave_receive_it(i2c_transfer_t *i2c_transfer)
{
	i2c_interrupt_transfers[i2c_transfer->channel] = *i2c_transfer;
	i2c_interrupt_callbacks[i2c_transfer->channel] = i2c_slave_receive_it_callback;
	*I2C_CR2[i2c_transfer->channel] |= (I2C_CR2_ITEVTEN_Msk | I2C_CR2_ITBUFEN_Msk);
}

static void i2c_clear_addr_bit(i2c_channel_t channel)
{
	volatile uint32_t status_reg = *I2C_SR1[channel];
	status_reg = *I2C_SR2[channel];
}

static void i2c_clear_stopf_bit(i2c_channel_t channel)
{
	volatile uint32_t status_reg = *I2C_SR1[channel];
	*I2C_CR1[channel] |= I2C_CR1_STOP_Msk;
}

static void i2c_one_byte_reception(i2c_transfer_t *i2c_transfer)
{
	uint32_t status_reg;
	*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
	i2c_clear_addr_bit(i2c_transfer->channel);
	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_STOP_Msk;
	do
	{
	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_RXNE_Msk;
	} while(status_reg == 0);
	*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
	i2c_transfer->buffer++;
	i2c_transfer->data_length--;
}

static void i2c_two_byte_reception(i2c_transfer_t *i2c_transfer)
{
	uint32_t status_reg;
	*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_POS_Msk;
	i2c_clear_addr_bit(i2c_transfer->channel);
	do
	{
		status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
	} while (status_reg == 0);
	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_STOP_Msk;
	*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
	i2c_transfer->buffer++;
	i2c_transfer->data_length--;
	*i2c_transfer->buffer = (uint8_t) *I2C_DR[i2c_transfer->channel];
	i2c_transfer->buffer++;
	i2c_transfer->data_length--;
}

static void i2c_n_byte_reception(i2c_transfer_t *i2c_transfer)
{
  uint32_t status_reg;
  while (i2c_transfer->data_length > 3)
  	{
  	  do
  	  {
  	    status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_RXNE_Msk;
  	  } while(status_reg ==  0);
	  *i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
  	  i2c_transfer->buffer++;
  	  i2c_transfer->data_length--;
  	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
  	  if (status_reg &&  i2c_transfer->data_length > 3)
  	  {
  		  *i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
  	  	  i2c_transfer->buffer++;
  	  	  i2c_transfer->data_length--;
  	  }
  	}

  	do
  	{
  	  status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
  	}while(status_reg == 0);

  	*I2C_CR1[i2c_transfer->channel] &= ~I2C_CR1_ACK_Msk;
  	*i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
  	i2c_transfer->buffer++;
  	i2c_transfer->data_length--;

 	do
  	{
  	 status_reg = *I2C_SR1[i2c_transfer->channel] & I2C_SR1_BTF_Msk;
  	} while(status_reg ==  0);
  	*I2C_CR1[i2c_transfer->channel] |= I2C_CR1_STOP_Msk;
  	*i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
  	i2c_transfer->buffer++;
  	i2c_transfer->data_length--;
  	*i2c_transfer->buffer = *I2C_DR[i2c_transfer->channel];
  	i2c_transfer->buffer++;
  	i2c_transfer->data_length--;
}

void i2c_irq_handler(i2c_channel_t channel)
{
	i2c_transfer_t *transfer = &i2c_interrupt_transfers[channel];
	if (i2c_interrupt_callbacks[channel] != 0)
	  i2c_interrupt_callbacks[channel](transfer);

}



